<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=ISO-8859-1">
<title>Rechte Maustaste sperren</title>
<link rel="stylesheet" type="text/css" href="../../src/selfhtml.css">
</head>
<body>

<h1><img src="../../src/netsc4.gif" width="30" height="30" alt="Netscape 4.0" title="Netscape 4.0"><img src="../../src/msie4.gif" width="30" height="30" alt="MS IE 4.0" title="MS IE 4.0"><img src="../../src/op72.gif" width="30" height="30" alt="Opera 7.20" title="Opera 7.20"><img src="../../src/ffox1.gif" width="30" height="30" alt="Mozilla Firefox 1" title="Mozilla Firefox 1"><img src="../../src/konq31.gif" width="30" height="30" alt="Konqueror 3.1" title="Konqueror 3.1"><img src="../../src/saf1.gif" width="30" height="30" alt="Safari 1.0" title="Safari 1.0"> Rechte Maustaste sperren</h1>

<p>Das folgende Script sperrt die rechte Maustaste, genauer gesagt verhindert es das Aufklappen des Kontextmen&uuml;s. Im Mozilla, Opera und Konqueror ist es m&ouml;glich, das Abfangen von Rechtsklicks durch JavaScript zu unterbinden. In diesen F&auml;llen funktioniert das Script nicht.</p>

<p>Bitte beachten Sie, dass dieses Script einige Techniken benutzt, die momentan nicht in SELFHTML dokumentiert sind, sondern nur hier Verwendung finden.</p>

<pre>
&lt;script type="text/javascript"&gt;
function click (e) {
  if (!e)
    e = window.event;
  if ((e.type &amp;&amp; e.type == "contextmenu") || (e.button &amp;&amp; e.button == 2) || (e.which &amp;&amp; e.which == 3)) {
    if (window.opera)
      window.alert("Sorry: Diese Funktion ist deaktiviert.");
    return false;
  }
}
if (document.layers)
  document.captureEvents(Event.MOUSEDOWN);
document.onmousedown = click;
document.oncontextmenu = click;
&lt;/script&gt;
</pre>

<p>Im Internet Explorer ab Version 5 sowie in Gecko-basierten Browsern (Mozilla, Mozilla Firefox usw.) tritt vor dem Aufklappen des Kontextmen&uuml;s das Ereignis <code>contextmenu</code> ein. Dieses ist urspr&uuml;nglich dazu gedacht, das Browser-Kontextmen&uuml; in geschlossenen Webanwendungen durch ein eigenes Kontextmen&uuml; zu ersetzen. Es ist aber auch m&ouml;glich, dar&uuml;ber schlichtweg das Aufklappen des Browser-Kontextmen&uuml;s zu verhindern, ohne stattdessen ein eigenes Kontextmen&uuml; auf Basis von HTML und CSS erscheinen zu lassen - vorausgesetzt, die Browsereinstellungen lassen dies zu.</p>
 
<p>&Uuml;ber <code>document.oncontextmenu = click;</code> wird die Funktion <code>click()</code> als <img src="../../src/dok.gif" width="15" height="10" alt="Seite">&nbsp;<a href="../../javascript/sprache/eventhandler.htm">Event-Handler</a> f&uuml;r das <code>contextmenu</code>-Ereignis beim Objekt <img src="../../src/dok.gif" width="15" height="10" alt="Seite">&nbsp;<a href="../../javascript/objekte/document.htm">document</a> angegeben. Dadurch wird die Funktion immer dann ausgef&uuml;hrt, wenn der Benutzer irgendwo im Dokument das Kontextmen&uuml; aktivieren will, z.B. durch einen Rechtsklick.</p>

<p>In IE 4, Netscape 4, Opera und Konqueror wird bei einem Rechtsklick lediglich ein regul&auml;res <img src="../../src/dok.gif" width="15" height="10" alt="Seite">&nbsp;<a href="../../javascript/sprache/eventhandler.htm#onmousedown">mousedown-Ereignis</a> erzeugt, genauso wie bei einem Linksklick. &Uuml;ber <code>document.onmousedown = click;</code> wird ebenfalls die Funktion <code>click()</code> als Event-Handler f&uuml;r alle Mausklicks im Dokument registriert.</p>

<p>Damit im Netscape 4 die Behandlung des <code>mousedown</code>-Ereignisses m&ouml;glich ist, muss zus&auml;tzlich <img src="../../src/dok.gif" width="15" height="10" alt="Seite">&nbsp;<a href="../../javascript/objekte/document.htm#capture_events">document.captureEvents</a> mit dem Parameter <code>Event.MOUSEDOWN</code> ausgef&uuml;hrt werden. Mit <code>if (document.layers)</code> wird vorher abgefragt, ob es sich um einen Netscape-4-Browser handelt.</p>

<p>Die Funktion <code>click()</code> wird folglich in zwei F&auml;llen ausgef&uuml;hrt: Bei einem <code>contextmenu</code>-Ereignis oder einem <code>mousedown</code>-Ereignis. Im ersten Fall kann das Ereignis sofort abgefangen werden. Im zweiten Fall muss erst gepr&uuml;ft werden, ob es sich um einen Klick mit der rechten Maustaste handelt. Die n&ouml;tigen Informationen - den Typ des Ereignisses sowie die gedr&uuml;ckte Maustaste - erh&auml;lt die Funktion &uuml;ber das <img src="../../src/dok.gif" width="15" height="10" alt="Seite">&nbsp;<a href="../../javascript/objekte/event.htm">Event-Objekt</a>. Doch bereits der Zugriff darauf gestaltet sich schwierig. Im Internet Explorer ist das Event-Objekt unter <code>window.event</code> abrufbar. In allen anderen Browsern wird es der Event-Handler-Funktion als Parameter &uuml;bergeben. Die Funktion <code>click()</code> nimmt daher einen Parameter mit dem Namen <code>e</code> entgegen. Eine if-Anweisung pr&uuml;ft direkt beim Start der Funktion, ob das Event-Objekt auf diese Weise &uuml;bergeben wurde und somit das Objekt <code>e</code> existiert (siehe <img src="../../src/dok.gif" width="15" height="10" alt="Seite">&nbsp;<a href="../../javascript/sprache/objekte.htm#existenzabfrage">Abfragen ob ein Objekt existiert</a>). Wenn dies nicht der Fall ist, wird das Event-Objekt aus <code>window.event</code> in die Variable <code>e</code> kopiert. Durch diese Zuweisung ist das Event-Objekt auf jeden Fall als <code>e</code> ansprechbar.</p>

<p>Im Folgenden pr&uuml;ft die Funktion, ob eine der drei folgenden Bedingungen erf&uuml;llt ist: Erstens wird abgefragt, ob der Typ des Ereignisses <img src="../../src/dok.gif" width="15" height="10" alt="Seite">&nbsp;<a href="../../javascript/objekte/event.htm#type">type</a> gleich <code>contextmenu</code> ist. Zweitens und Drittens wird abgefragt, ob die rechte Maustaste gedr&uuml;ckt wurde. Im Internet Explorer, Opera, Mozilla und Konqueror l&auml;sst sich mithilfe der Eigenschaft <img src="../../src/dok.gif" width="15" height="10" alt="Seite">&nbsp;<a href="../../javascript/objekte/event.htm#button">button</a> des Event-Objekts in Erfahrung bringen, welche Maustaste gedr&uuml;ckt wurde. Die Zahl <code>2</code> steht einhellig f&uuml;r die rechte Maustaste. Im Netscape 4 hingegen hei&szlig;t die Eigenschaft <img src="../../src/dok.gif" width="15" height="10" alt="Seite">&nbsp;<a href="../../javascript/objekte/event.htm#which">which</a>. In dem Fall steht die Zahl <code>3</code> f&uuml;r die rechte Maustaste. Bei allen drei Abfragen wird vorher gepr&uuml;ft, ob die jeweilige verwendete Event-Eigenschaft existiert, sodass das Script mit den zur Verf&uuml;gung stehenden Objekten arbeitet.</p>

<p>Wenn also eine dieser Bedingungen zutrifft, muss das Ereignis abgefangen werden, um das Erscheinen des Kontextmen&uuml;s zu unterbinden. Dies wird mit dem <img src="../../src/dok.gif" width="15" height="10" alt="Seite">&nbsp;<a href="../../javascript/sprache/funktionen.htm#rueckgabewert">R&uuml;ckgabewert</a> <code>false</code> bewerkstelligt. Vorher jedoch muss unter gewissen Umst&auml;nden ein <img src="../../src/dok.gif" width="15" height="10" alt="Seite">&nbsp;<a href="../../javascript/objekte/window.htm#alert">Dialogfenster</a> angezeigt werden, und zwar nur dann, wenn das Script vom Opera-Browser ausgef&uuml;hrt wird. Dies wird &uuml;ber <code>if (window.opera)</code> abgefragt. Genau genommen ist das Dialogfenster f&uuml;r Opera 8 n&ouml;tig. In fr&uuml;heren Opera-Versionen f&uuml;hrt bereits <code>document.onmousedown = click;</code> dazu, dass alle Kontextmen&uuml;s deaktiviert werden - ohne dass die Funktion <code>click()</code> bei einem Rechtsklick &uuml;berhaupt ausgef&uuml;hrt wird. In Version 8 ist dieser Fehler behoben. Zudem reicht ein einfaches <code>return false;</code> nicht mehr aus, um das Aufklappen des Kontextmen&uuml;s zu verhindern. Es muss zus&auml;tzlich ein Dialogfenster angezeigt werden. Das Dialogfenster kann nicht einfach in allen Browsern angezeigt werden, denn z.B. Mozilla erzeugt bei einem Rechtsklick sowohl ein <code>mousedown</code>- als auch ein <code>contextmenu</code>-Ereignis. Daher w&uuml;rden bei einem Rechtsklick zwei Dialogfenster angezeigt.</p>

<p><img src="../../src/dok.gif" width="15" height="10" alt="Seite">&nbsp;<a href="../faq.htm#rechte_maustaste">zur&uuml;ck</a></p>

</body>
</html>
